OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f87j11.h
/*
 * This declarations of the PIC18F87J11 MCU.
 *
 * This file is part of the GNU PIC library for SDCC, originally
 * created by Molnar Karoly <molnarkaroly@users.sf.net> 2016.
 *
 * This file is generated automatically by the cinc2h.pl, 2016-04-13 17:23:39 UTC.
 *
 * SDCC is licensed under the GNU Public license (GPL) v2. Note that
 * this license covers the code to the compiler and other executables,
 * but explicitly does not cover any code or objects generated by sdcc.
 *
 * For pic device libraries and header files which are derived from
 * Microchip header (.inc) and linker script (.lkr) files Microchip
 * requires that "The header files should state that they are only to be
 * used with authentic Microchip devices" which makes them incompatible
 * with the GPL. Pic device libraries and header files are located at
 * non-free/lib and non-free/include directories respectively.
 * Sdcc should be run with the --use-non-free command line option in
 * order to include non-free header files and libraries.
 *
 * See http://sdcc.sourceforge.net/ for the latest information on sdcc.
 */

#ifndef __PIC18F87J11_H__
#define __PIC18F87J11_H__

//==============================================================================

//==============================================================================
//
//	Register Definitions
//
//==============================================================================

extern __at(0x0F5A) __sfr PMSTAT;

//==============================================================================
//        PMSTATL Bits

extern __at(0x0F5A) __sfr PMSTATL;

typedef struct
  {
  unsigned OB0E                 : 1;
  unsigned OB1E                 : 1;
  unsigned OB2E                 : 1;
  unsigned OB3E                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned OBUF                 : 1;
  unsigned OBE                  : 1;
  } __PMSTATLbits_t;

extern __at(0x0F5A) volatile __PMSTATLbits_t PMSTATLbits;

#define _OB0E                   0x01
#define _OB1E                   0x02
#define _OB2E                   0x04
#define _OB3E                   0x08
#define _OBUF                   0x40
#define _OBE                    0x80

//==============================================================================


//==============================================================================
//        PMSTATH Bits

extern __at(0x0F5B) __sfr PMSTATH;

typedef struct
  {
  unsigned IB0F                 : 1;
  unsigned IB1F                 : 1;
  unsigned IB2F                 : 1;
  unsigned IB3F                 : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned IBOV                 : 1;
  unsigned IBF                  : 1;
  } __PMSTATHbits_t;

extern __at(0x0F5B) volatile __PMSTATHbits_t PMSTATHbits;

#define _IB0F                   0x01
#define _IB1F                   0x02
#define _IB2F                   0x04
#define _IB3F                   0x08
#define _IBOV                   0x40
#define _IBF                    0x80

//==============================================================================


//==============================================================================
//        PMEL Bits

extern __at(0x0F5C) __sfr PMEL;

typedef struct
  {
  unsigned PTEN0                : 1;
  unsigned PTEN1                : 1;
  unsigned PTEN2                : 1;
  unsigned PTEN3                : 1;
  unsigned PTEN4                : 1;
  unsigned PTEN5                : 1;
  unsigned PTEN6                : 1;
  unsigned PTEN7                : 1;
  } __PMELbits_t;

extern __at(0x0F5C) volatile __PMELbits_t PMELbits;

#define _PTEN0                  0x01
#define _PTEN1                  0x02
#define _PTEN2                  0x04
#define _PTEN3                  0x08
#define _PTEN4                  0x10
#define _PTEN5                  0x20
#define _PTEN6                  0x40
#define _PTEN7                  0x80

//==============================================================================

extern __at(0x0F5C) __sfr PMEN;

//==============================================================================
//        PMEH Bits

extern __at(0x0F5D) __sfr PMEH;

typedef struct
  {
  unsigned PTEN8                : 1;
  unsigned PTEN9                : 1;
  unsigned PTEN10               : 1;
  unsigned PTEN11               : 1;
  unsigned PTEN12               : 1;
  unsigned PTEN13               : 1;
  unsigned PTEN14               : 1;
  unsigned PTEN15               : 1;
  } __PMEHbits_t;

extern __at(0x0F5D) volatile __PMEHbits_t PMEHbits;

#define _PTEN8                  0x01
#define _PTEN9                  0x02
#define _PTEN10                 0x04
#define _PTEN11                 0x08
#define _PTEN12                 0x10
#define _PTEN13                 0x20
#define _PTEN14                 0x40
#define _PTEN15                 0x80

//==============================================================================

extern __at(0x0F5E) __sfr PMDIN2;
extern __at(0x0F5E) __sfr PMDIN2L;
extern __at(0x0F5F) __sfr PMDIN2H;
extern __at(0x0F60) __sfr PMDOUT2;
extern __at(0x0F60) __sfr PMDOUT2L;
extern __at(0x0F61) __sfr PMDOUT2H;
extern __at(0x0F62) __sfr PMMODE;

//==============================================================================
//        PMMODEL Bits

extern __at(0x0F62) __sfr PMMODEL;

typedef union
  {
  struct
    {
    unsigned WAITE0             : 1;
    unsigned WAITE1             : 1;
    unsigned WAITM0             : 1;
    unsigned WAITM1             : 1;
    unsigned WAITM2             : 1;
    unsigned WAITM3             : 1;
    unsigned WAITB0             : 1;
    unsigned WAITB1             : 1;
    };

  struct
    {
    unsigned WAITE              : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 2;
    unsigned WAITM              : 4;
    unsigned                    : 2;
    };

  struct
    {
    unsigned                    : 6;
    unsigned WAITB              : 2;
    };
  } __PMMODELbits_t;

