OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f87j11.h
extern __at(0x0F82) volatile __PORTCbits_t PORTCbits;

#define _PORTC_RC0              0x01
#define _PORTC_T1OSO            0x01
#define _PORTC_T13CKI           0x01
#define _PORTC_RC1              0x02
#define _PORTC_T1OSI            0x02
#define _PORTC_CCP2             0x02
#define _PORTC_RC2              0x04
#define _PORTC_CCP1             0x04
#define _PORTC_RC3              0x08
#define _PORTC_SCK              0x08
#define _PORTC_SCL              0x08
#define _PORTC_RC4              0x10
#define _PORTC_SDI              0x10
#define _PORTC_SDA              0x10
#define _PORTC_RC5              0x20
#define _PORTC_SDO              0x20
#define _PORTC_RC6              0x40
#define _PORTC_TX               0x40
#define _PORTC_CK               0x40
#define _PORTC_RC7              0x80
#define _PORTC_RX               0x80

//==============================================================================


//==============================================================================
//        PORTD Bits

extern __at(0x0F83) __sfr PORTD;

typedef union
  {
  struct
    {
    unsigned RD0                : 1;
    unsigned RD1                : 1;
    unsigned RD2                : 1;
    unsigned RD3                : 1;
    unsigned RD4                : 1;
    unsigned RD5                : 1;
    unsigned RD6                : 1;
    unsigned RD7                : 1;
    };

  struct
    {
    unsigned PMD0               : 1;
    unsigned PMD1               : 1;
    unsigned PMD2               : 1;
    unsigned PMD3               : 1;
    unsigned PMD4               : 1;
    unsigned PMD5               : 1;
    unsigned PMD6               : 1;
    unsigned PMD7               : 1;
    };

  struct
    {
    unsigned AD0                : 1;
    unsigned AD1                : 1;
    unsigned AD2                : 1;
    unsigned AD3                : 1;
    unsigned AD4                : 1;
    unsigned AD5                : 1;
    unsigned AD6                : 1;
    unsigned AD7                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned SDO2               : 1;
    unsigned SDA2               : 1;
    unsigned SCL2               : 1;
    unsigned SS2                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned SDI2               : 1;
    unsigned SCK2               : 1;
    unsigned                    : 1;
    };
  } __PORTDbits_t;

extern __at(0x0F83) volatile __PORTDbits_t PORTDbits;

#define _PORTD_RD0              0x01
#define _PORTD_PMD0             0x01
#define _PORTD_AD0              0x01
#define _PORTD_RD1              0x02
#define _PORTD_PMD1             0x02
#define _PORTD_AD1              0x02
#define _PORTD_RD2              0x04
#define _PORTD_PMD2             0x04
#define _PORTD_AD2              0x04
#define _PORTD_RD3              0x08
#define _PORTD_PMD3             0x08
#define _PORTD_AD3              0x08
#define _PORTD_RD4              0x10
#define _PORTD_PMD4             0x10
#define _PORTD_AD4              0x10
#define _PORTD_SDO2             0x10
#define _PORTD_RD5              0x20
#define _PORTD_PMD5             0x20
#define _PORTD_AD5              0x20
#define _PORTD_SDA2             0x20
#define _PORTD_SDI2             0x20
#define _PORTD_RD6              0x40
#define _PORTD_PMD6             0x40
#define _PORTD_AD6              0x40
#define _PORTD_SCL2             0x40
#define _PORTD_SCK2             0x40
#define _PORTD_RD7              0x80
#define _PORTD_PMD7             0x80
#define _PORTD_AD7              0x80
#define _PORTD_SS2              0x80

//==============================================================================


//==============================================================================
//        PORTE Bits

extern __at(0x0F84) __sfr PORTE;

typedef union
  {
  struct
    {
    unsigned RE0                : 1;
    unsigned RE1                : 1;
    unsigned RE2                : 1;
    unsigned RE3                : 1;
    unsigned RE4                : 1;
    unsigned RE5                : 1;
    unsigned RE6                : 1;
    unsigned RE7                : 1;
    };

  struct
    {
    unsigned AD8                : 1;
    unsigned AD9                : 1;
    unsigned AD10               : 1;
    unsigned AD11               : 1;
    unsigned AD12               : 1;
    unsigned AD13               : 1;
    unsigned AD14               : 1;
    unsigned AD15               : 1;
    };

  struct
    {
    unsigned PMRD               : 1;
    unsigned PMWR               : 1;
    unsigned PMBE               : 1;
    unsigned PMA13              : 1;
    unsigned PMA12              : 1;
    unsigned PMA11              : 1;
    unsigned PMA10              : 1;
    unsigned PMA9               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned REFO               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CCP2               : 1;
    };
  } __PORTEbits_t;

extern __at(0x0F84) volatile __PORTEbits_t PORTEbits;

#define _PORTE_RE0              0x01
#define _PORTE_AD8              0x01
#define _PORTE_PMRD             0x01
#define _PORTE_RE1              0x02
#define _PORTE_AD9              0x02
#define _PORTE_PMWR             0x02
#define _PORTE_RE2              0x04
#define _PORTE_AD10             0x04
#define _PORTE_PMBE             0x04
#define _PORTE_RE3              0x08
#define _PORTE_AD11             0x08
#define _PORTE_PMA13            0x08
#define _PORTE_REFO             0x08
#define _PORTE_RE4              0x10
#define _PORTE_AD12             0x10
#define _PORTE_PMA12            0x10
#define _PORTE_RE5              0x20
#define _PORTE_AD13             0x20
#define _PORTE_PMA11            0x20
#define _PORTE_RE6              0x40
#define _PORTE_AD14             0x40
#define _PORTE_PMA10            0x40
#define _PORTE_RE7              0x80
#define _PORTE_AD15             0x80
#define _PORTE_PMA9             0x80
#define _PORTE_CCP2             0x80

//==============================================================================


//==============================================================================
//        PORTF Bits

extern __at(0x0F85) __sfr PORTF;

typedef union
  {
  struct
    {
    unsigned                    : 1;
    unsigned RF1                : 1;
    unsigned RF2                : 1;
    unsigned RF3                : 1;
    unsigned RF4                : 1;
    unsigned RF5                : 1;
    unsigned RF6                : 1;
    unsigned RF7                : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned AN6                : 1;
    unsigned AN7                : 1;
    unsigned AN8                : 1;
    unsigned AN9                : 1;
    unsigned AN10               : 1;
    unsigned AN11               : 1;
    unsigned SS                 : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned C2OUT              : 1;
    unsigned C1OUT              : 1;
    unsigned C2INB              : 1;
    unsigned C2INA              : 1;
    unsigned CVREF              : 1;
    unsigned C1INA              : 1;
    unsigned PMD0               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PMA5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned C1INB              : 1;
    unsigned PMD1               : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PMD2               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PORTFbits_t;

extern __at(0x0F85) volatile __PORTFbits_t PORTFbits;

#define _PORTF_RF1              0x02
#define _PORTF_AN6              0x02
#define _PORTF_C2OUT            0x02
#define _PORTF_RF2              0x04
#define _PORTF_AN7              0x04
#define _PORTF_C1OUT            0x04
#define _PORTF_PMA5             0x04
#define _PORTF_RF3              0x08
#define _PORTF_AN8              0x08
#define _PORTF_C2INB            0x08
#define _PORTF_RF4              0x10
#define _PORTF_AN9              0x10
#define _PORTF_C2INA            0x10
#define _PORTF_RF5              0x20
#define _PORTF_AN10             0x20
#define _PORTF_CVREF            0x20
#define _PORTF_C1INB            0x20
#define _PORTF_PMD2             0x20
#define _PORTF_RF6              0x40
#define _PORTF_AN11             0x40
#define _PORTF_C1INA            0x40
#define _PORTF_PMD1             0x40
#define _PORTF_RF7              0x80
#define _PORTF_SS               0x80
#define _PORTF_PMD0             0x80

//==============================================================================


//==============================================================================
//        PORTG Bits

extern __at(0x0F86) __sfr PORTG;

typedef union
  {
  struct
    {
    unsigned RG0                : 1;
    unsigned RG1                : 1;
    unsigned RG2                : 1;
    unsigned RG3                : 1;
    unsigned RG4                : 1;
    unsigned RJPU               : 1;
    unsigned REPU               : 1;
    unsigned RDPU               : 1;
    };

  struct
    {
    unsigned CCP3               : 1;
    unsigned TX2                : 1;
    unsigned RX2                : 1;
    unsigned CCP4               : 1;
    unsigned CCP5               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PMA8               : 1;
    unsigned CK2                : 1;
    unsigned DT2                : 1;
    unsigned PMCS1              : 1;
    unsigned PMCS2              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned PMA7               : 1;
    unsigned PMA6               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RG                 : 5;
    unsigned                    : 3;
    };
  } __PORTGbits_t;

extern __at(0x0F86) volatile __PORTGbits_t PORTGbits;

#define _PORTG_RG0              0x01
#define _PORTG_CCP3             0x01
#define _PORTG_PMA8             0x01
#define _PORTG_RG1              0x02
#define _PORTG_TX2              0x02
#define _PORTG_CK2              0x02
#define _PORTG_PMA7             0x02
#define _PORTG_RG2              0x04
#define _PORTG_RX2              0x04
#define _PORTG_DT2              0x04
#define _PORTG_PMA6             0x04
#define _PORTG_RG3              0x08
#define _PORTG_CCP4             0x08
#define _PORTG_PMCS1            0x08
#define _PORTG_RG4              0x10
#define _PORTG_CCP5             0x10
#define _PORTG_PMCS2            0x10
#define _PORTG_RJPU             0x20
#define _PORTG_REPU             0x40
#define _PORTG_RDPU             0x80

//==============================================================================


//==============================================================================
//        PORTH Bits

extern __at(0x0F87) __sfr PORTH;

typedef union
  {
  struct
    {
    unsigned RH0                : 1;
    unsigned RH1                : 1;
    unsigned RH2                : 1;
    unsigned RH3                : 1;
    unsigned RH4                : 1;
    unsigned RH5                : 1;
    unsigned RH6                : 1;
    unsigned RH7                : 1;
    };

  struct
    {
    unsigned A16                : 1;
    unsigned A17                : 1;
    unsigned A18                : 1;
    unsigned A19                : 1;
    unsigned AN12               : 1;
    unsigned AN13               : 1;
    unsigned AN14               : 1;
    unsigned AN15               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned PMD7               : 1;
    unsigned PMD6               : 1;
    unsigned PMD3               : 1;
    unsigned PMBE               : 1;
    unsigned PMRD               : 1;
    unsigned PMWR               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned C2INC              : 1;
    unsigned C2IND              : 1;
    unsigned C1INC              : 1;
    unsigned                    : 1;
    };
  } __PORTHbits_t;

extern __at(0x0F87) volatile __PORTHbits_t PORTHbits;

